backend/load-test-artillery.yml
# Artillery Load Test Configuration
# 
# Cài đặt: npm install -g artillery
# Chạy: artillery run load-test-artillery.yml
#
# Hoặc với report:
# artillery run load-test-artillery.yml --output report.json
# artillery report report.json

config:
  target: 'http://localhost:5000'
  phases:
    # Warm up: 10 users/giây trong 30s
    - duration: 30
      arrivalRate: 10
      name: "Warm up"
    
    # Load test: 50 users/giây trong 2 phút
    - duration: 120
      arrivalRate: 50
      name: "Load test"
    
    # Stress test: 100 users/giây trong 1 phút
    - duration: 60
      arrivalRate: 100
      name: "Stress test"
    
    # Spike test: 200 users/giây trong 30s
    - duration: 30
      arrivalRate: 200
      name: "Spike test"
  
  defaults:
    headers:
      Content-Type: 'application/json'
      Authorization: 'Bearer YOUR_TOKEN_HERE'  # Thay bằng token thật

scenarios:
  - name: "Start Exam Session"
    weight: 70
    flow:
      - post:
          url: "/exam/exam-sessions/start"
          json:
            test_id: 1
            session_type: "FULL_TEST"
            selected_parts: [1, 2, 3, 4, 5, 6, 7]
            time_limit_minutes: 120
          capture:
            - json: "$.DT.exam_session_id"
              as: "sessionId"
          expect:
            - statusCode: 200
            - contentType: json
            - hasProperty: DT
      
      - think: 1  # Nghỉ 1 giây
      
      - post:
          url: "/exam/exam-sessions/{{sessionId}}/auto-save"
          json:
            question_id: 1
            selected_choice_id: 10
          expect:
            - statusCode: 200

  - name: "Get Active Sessions"
    weight: 20
    flow:
      - get:
          url: "/exam/exam-sessions/active"
          expect:
            - statusCode: 200

  - name: "Restore Answers"
    weight: 10
    flow:
      - get:
          url: "/exam/exam-sessions/{{sessionId}}/restore"
          expect:
            - statusCode: 200